#!usr/bin/python3.8

'''
#============================================================================
# Name        : initial2.py
#建立一個2*3的二維陣列並初始化，用來儲存2個學生各三科成績，再以2層巢狀迴圈將所有成績顯示出來。

#============================================================

第1位學生第1科成績:85
第1位學生第2科成績:82
第1位學生第3科成績:90
#================================================
第2位學生第1科成績:76
第2位學生第2科成績:95
第2位學生第3科成績:89
#================================================

'''
if __name__ == '__main__':
    students = [[85, 82, 90],[76, 95, 89]]
    for index,student in enumerate(students):
        for n,score in enumerate(student):
            print('第{0:d}位學生第{1:d}科成績:{2:d}'.format(index+1, n+1 ,score))
        print('===================================')

