#!usr/bin/python3.8

'''
# Name        : score1.py
#建立一個包含五個元素的整數陣列，讓使用者輸入五位學生的成績，然後計算班級總成績及平均成績
#============================================================
請輸入第1位學的成績78
請輸入第2位學的成績89
請輸入第3位學的成績67
請輸入第4位學的成績90
請輸入第5位學的成績89
全班總成績為:413分,平均為82.6分
#============================================================
'''

nums = 5
scores = []
sum = 0
for i in range(5):
    i += 1
    print("請輸入第{0:d}位學生的資料:".format(i))
    scores.append(int(input()))

for score in scores:
    sum += score;

ave = sum / nums
print("全班總成績為:{0:d}分,平均為{1:.2f}分".format(sum, ave))