import streamlit as st

st.title("非聯合國氣候公約締約國 台灣以NGO名義參加COP27")
st.write("2022-11-06 19:45 聯合報／ 記者蘇彥誠、周妤靜／夏姆錫克即時報導")

st.image('image1.png')

col1, col2 = st.columns(2)

with col1:
    st.write("第27屆聯合國氣候峰會（COP27）於11月6日開幕，為期兩周，地點在埃及夏姆錫克（Sharm El Sheikh）。主辦單位估計全球約有3萬5千名與會者，包含各國領袖、談判代表及公民團體等，台灣也有不少參與者。台灣並非聯合國氣候變遷綱要公約（UNFCCC）197個締約國之一，歷年來以「NGO觀察員」名義參與氣候峰會。")

    st.write("今年八月美國眾議院議長裴洛西（Nancy Pelosi）訪台後，美中兩國暫停氣候變遷商談，台灣意外成為今年外媒討論COP27時，常提及的國家。台灣氣候行動網絡研究中心總監趙家緯認為，台灣出現在COP27國際輿論中，不能只是美中談判暫停的註腳，還要思考如何突圍。")

    st.write("趙家緯指出，台灣許多外交互動與氣候變遷相關，卻很少把經費援助與氣候基金、國際正談論的損失與損害（loss and damage，指氣候變遷下無法藉減緩或調適避免的衝擊）進一步結合。他表示，成立損失與損害基金是台灣可突圍的一個方式，「因為捐錢沒有人不想收」；如果藉此協助友邦島國，可能比起不斷強調台灣發展綠能的成果，更能獲得世界關注。")

    st.write("行政院能源及減碳辦公室副執行長林子倫指出，聯合國氣候峰會較具包容性，設有各種NGO參與機制，與世界衛生組織（WHO）不同，因此台灣可以取得發聲空間。「台灣可以在（氣候危機）解方上有貢獻。」林子倫舉例，國際合作發展基金會協助邦交國因應氣候變遷有不少貢獻。")

with col2:
    st.write("第27屆聯合國氣候峰會（COP27）於11月6日開幕，為期兩周，地點在埃及夏姆錫克（Sharm El Sheikh）。主辦單位估計全球約有3萬5千名與會者，包含各國領袖、談判代表及公民團體等，台灣也有不少參與者。台灣並非聯合國氣候變遷綱要公約（UNFCCC）197個締約國之一，歷年來以「NGO觀察員」名義參與氣候峰會。")