#!usr/bin/python3

'''
#============================================================================
# Name        : while2.py
#小明想要存錢買一輛機車,機車每輛30000元，他將每月存的錢輸入，當存款足夠買機車時，就顯示提示訊息告知。
#============================================================================

顯示:
請輸入第1個月份的存款:4567
請輸入第2個月份的存款:3456
請輸入第3個月份的存款:4567
請輸入第4個月份的存款:4567
請輸入第5個月份的存款:4567
請輸入第6個月份的存款:5678
請輸入第7個月份的存款:7890
恭喜! 已經存夠了，存了7個月的總存款為:35292元。
'''

deposit = 0
num = 0
while(deposit < 30000):
    num += 1
    inputNum = int(input('請輸入第'+str(num)+"個月份的存款:"))
    deposit += inputNum

print("恭喜!已經存夠了，存了",num,"個月的總存款為:",deposit,"元。")